Repository: mubtAAhij/LabLLM
Catalog: Sources/LabLLM/Resources/Localizable.xcstrings
Source language: en
Languages: es_419

# app-state.viewer-import.no-recognized-conversation-columns
source: This dataset doesn't expose recognized messages, instruction/output, or prompt/response columns.
es_419: Este dataset no expone columnas reconocidas de mensajes, instruction/output ni prompt/response.

# app-state.dataset-source.hugging-face-viewer-with-id
source: Hugging Face Viewer · %@
es_419: Visor de Hugging Face · %@

# app-state.imessage-import.title
source: Importing iMessage chats
es_419: Importando chats de iMessage

# app-state.imessage-import.no-usable-conversations
source: No usable text conversations were found. Choose chat.db and allow Full Disk Access for LabLLM if macOS blocks it.
es_419: No se encontraron conversaciones de texto útiles. Elige chat.db y otorga Acceso completo al disco a LabLLM si macOS lo bloquea.

# app-state.imessage-import.source-title
source: iMessage chats
es_419: Chats de iMessage

# app-state.imessage-import.source-subtitle
source: Local iMessage database
es_419: Base de datos local de iMessage

# app-state.file-import.read-utf8-failed
source: Couldn't read that file as UTF-8 text.
es_419: No se pudo leer ese archivo como texto UTF-8.

# app-state.quantization.progress-title
source: Quantizing
es_419: Cuantizando

# trainer.state.idle
source: Idle
es_419: Inactivo

# trainer.state.paused
source: Paused
es_419: Pausado

# trainer.state.training
source: Training
es_419: Entrenando

# trainer.status.preparing
source: Preparing…
es_419: Preparando…

# trainer.status.resumed-from-checkpoint
source: Resumed from %@
es_419: Reanudado desde %@

# trainer.status.legacy-checkpoint-no-optimizer-rng
source: Loaded legacy checkpoint weights; optimizer/RNG state unavailable
es_419: Se cargaron pesos de checkpoint antiguo; estado del optimizador/RNG no disponible

# trainer.mode.training
source: Training
es_419: Entrenamiento

# trainer.mode.pretraining
source: Pretraining
es_419: Preentrenamiento

# trainer.progress.pretraining
source: Pretraining
es_419: Preentrenamiento

# trainer.status.stopped-at-step-progress-saved
source: Stopped at step %d — progress saved
es_419: Detenido en el paso %d — progreso guardado

# trainer.status.training-done
source: Training done
es_419: Entrenamiento completado

# trainer.status.checkpoint-saved-suffix
source: — checkpoint saved
es_419: — checkpoint guardado

# trainer.status.preparing-finetuning
source: Preparing fine-tuning…
es_419: Preparando ajuste fino…

# trainer.status.legacy-checkpoint-no-optimizer-rng-finetuning
source: Loaded legacy checkpoint weights; optimizer/RNG state unavailable
es_419: Pesos de checkpoint heredado cargados; estado del optimizador/RNG no disponible

# trainer.mode.finetuning-lora
source: Fine-tuning (LoRA)
es_419: Ajuste fino (LoRA)

# trainer.mode.finetuning-full
source: Fine-tuning (full)
es_419: Ajuste fino (completo)

# trainer.error.no-sft-loss
source: MLX returned no SFT loss. Try disabling LoRA for this run or reducing batch/context size.
es_419: MLX no devolvió pérdida de SFT. Intenta deshabilitar LoRA para esta ejecución o reducir el tamaño de batch/contexto.

# trainer.error.finetuning-stopped
source: Fine-tuning stopped: %@
es_419: Ajuste fino detenido: %@

# trainer.error.finetuning-needs-attention
source: Fine-tuning needs attention
es_419: El ajuste fino requiere atención

# trainer.progress.finetuning
source: Fine-tuning
es_419: Ajuste fino

# trainer.mode.sft-full
source: SFT (full)
es_419: SFT (completo)

# trainer.status.stopped-at-step-progress-saved-sft
source: Stopped at step %d — progress saved
es_419: Detenido en el paso %d — progreso guardado

# trainer.status.finetuning-done
source: Fine-tuning done
es_419: Ajuste fino completado

# trainer.status.checkpoint-saved-suffix-finetuning
source: — checkpoint saved
es_419: — checkpoint guardado

# trainer.error.dpo-requires-finetuned-model
source: DPO needs a fine-tuned model in memory first — run SFT, then DPO.
es_419: DPO necesita primero un modelo con ajuste fino en memoria — ejecuta SFT y luego DPO.

# trainer.status.preparing-dpo
source: Preparing DPO…
es_419: Preparando DPO…

# trainer.progress.dpo-training
source: DPO training
es_419: Entrenamiento DPO

# trainer.status.stopped-at-step-progress-saved-dpo
source: Stopped at step %d — progress saved
es_419: Detenido en el paso %d — progreso guardado

# trainer.status.dpo-done
source: DPO done
es_419: DPO completado

# trainer.status.checkpoint-saved-suffix-dpo
source: — checkpoint saved
es_419: — checkpoint guardado

# trainer.state.idle-restored
source: Idle
es_419: Inactivo

# trainer.state.idle-reset
source: Idle
es_419: Inactivo

# trainer.state.idle-default
source: Idle
es_419: Inactivo

# trainer.status.loaded-checkpoint
source: Loaded checkpoint
es_419: Checkpoint cargado

# trainer.error.could-not-save-checkpoint
source: Couldn't save checkpoint: %@
es_419: No se pudo guardar el checkpoint: %@

# settings.system.section-title
source: System
es_419: Sistema

# settings.system.page-title
source: Settings
es_419: Configuración

# settings.system.page-subtitle
source: Control how LabLLM presents itself and guides your work.
es_419: Controla cómo LabLLM se presenta y guía tu trabajo.

# settings.system.mode.label
source: Mode
es_419: Modo

# settings.appearance.section-title
source: Appearance
es_419: Apariencia

# settings.appearance.theme.label
source: Theme
es_419: Tema

# settings.appearance.accent.label
source: Accent
es_419: Acento

# settings.appearance.validation-loss-color.label
source: Validation loss color
es_419: Color de pérdida de validación

# settings.guidance.section-title
source: Guidance
es_419: Orientación

# settings.guidance.show-inline-tips
source: Show inline tips
es_419: Mostrar consejos en línea

# settings.guidance.show-animated-welcome-background
source: Show animated welcome background
es_419: Mostrar fondo animado de bienvenida

# settings.guidance.show-welcome-on-first-launch
source: Show welcome automatically on first launch
es_419: Mostrar bienvenida automáticamente en el primer inicio

# settings.guidance.replay-tutorial.button
source: Replay tutorial
es_419: Repetir tutorial

# settings.guidance.show-welcome-screen.button
source: Show welcome screen
es_419: Muestra la pantalla de bienvenida

# settings.features.section-title
source: Features
es_419: Funcionalidades

# settings.features.use-feature-gates
source: Use Simple / Advanced / Expert feature gates
es_419: Usar niveles de funcionalidad Básico / Avanzado / Experto

# settings.features.show-sidebar-section-headers
source: Show sidebar section headers
es_419: Mostrar encabezados de sección de la barra lateral

# settings.features.show-training-status-badge
source: Show training status badge
es_419: Mostrar insignia de estado de entrenamiento

# settings.features.show-dataset-browser-hints
source: Show dataset browser hints
es_419: Mostrar sugerencias del navegador de datasets

# settings.features.visible-pages.label
source: Visible pages
es_419: Páginas visibles

# settings.features.reset-visibility.button
source: Reset feature visibility
es_419: Restablecer visibilidad de funciones

# settings.layout.section-title
source: Layout
es_419: Diseño

# settings.layout.density.label
source: Density
es_419: Densidad

# settings.layout.corner-radius.label
source: Corner radius
es_419: Radio de esquina

# settings.layout.panel-opacity.label
source: Panel opacity
es_419: Opacidad del panel

# settings.layout.sidebar-width.label
source: Sidebar width
es_419: Ancho de la barra lateral

# settings.layout.reset-customization.button
source: Reset customization
es_419: Restablecer personalización

# settings.about.section-title
source: About
es_419: Acerca de

# settings.about.description
source: LabLLM — local GPT training on Apple MLX.
es_419: LabLLM — entrenamiento de GPT local en Apple MLX.

# settings.about.hardware-summary
source: Chip: %@ · %@ unified memory
es_419: Chip: %@ · %@ de memoria unificada

# settings.visible-pages.always-visible
source: Always visible
es_419: Siempre visible

# settings.visible-pages.hidden-by-mode
source: Hidden by current mode
es_419: Oculto por el modo actual

# settings.visible-pages.settings-cannot-hide
source: Settings cannot be hidden.
es_419: La Configuración no se puede ocultar.

# settings.visible-pages.show-or-hide-section
source: Show or hide %@ in the sidebar.
es_419: Mostrar u ocultar %@ en la barra lateral.

# checkpoints.header.run-studio
source: Run Studio
es_419: Estudio de ejecuciones

# checkpoints.header.subtitle
source: Saved runs for “%@”. Inspect, continue, duplicate, quantize, and organize this model's checkpoints.
es_419: Ejecuciones guardadas para "%@". Inspecciona, continúa, duplica, cuantiza y organiza los checkpoints de este modelo.

# checkpoints.actions.refresh
source: Refresh
es_419: Actualizar

# checkpoints.help.switch-model
source: Checkpoints belong to the selected model. Switch models from the box at the top left of the sidebar.
es_419: Los checkpoints pertenecen al modelo seleccionado. Cambia de modelo desde el cuadro en la parte superior izquierda de la barra lateral.

# checkpoints.empty.title
source: No checkpoints for this model yet
es_419: Aún no hay checkpoints para este modelo

# checkpoints.empty.message
source: Finish (or stop) a training run for “%@” and it will be saved here automatically.
es_419: Finaliza (o detén) una ejecución de entrenamiento para "%@" y se guardará aquí automáticamente.

# checkpoints.rename.title
source: Rename checkpoint
es_419: Renombrar checkpoint

# checkpoints.rename.name-field-label
source: Checkpoint name
es_419: Nombre del checkpoint

# checkpoints.rename.confirm
source: Rename
es_419: Renombrar

# checkpoints.rename.cancel
source: Cancel
es_419: Cancelar

# checkpoints.rename.help
source: Use a concise local name for this checkpoint.
es_419: Usa un nombre local conciso para este checkpoint.

# checkpoints.badge.best
source: BEST
es_419: MEJOR

# checkpoints.table.column.step
source: Step
es_419: Paso

# checkpoints.table.column.loss
source: Loss
es_419: Pérdida

# checkpoints.table.column.params
source: Params
es_419: Paráms.

# checkpoints.table.column.vocab
source: Vocab
es_419: Vocabulario

# checkpoints.actions.load-for-sampling
source: Load for sampling
es_419: Cargar para muestreo

# checkpoints.actions.continue-training
source: Continue training
es_419: Continuar entrenamiento

# checkpoints.actions.continue-fine-tuning
source: Continue fine-tuning
es_419: Continuar ajuste fino

# checkpoints.actions.quantize
source: Quantize
es_419: Cuantizar

# checkpoints.actions.view-model-card
source: View model card
es_419: Ver tarjeta del modelo

# checkpoints.actions.rename
source: Rename
es_419: Renombrar

# checkpoints.actions.duplicate
source: Duplicate
es_419: Duplicar

# checkpoints.actions.reveal-in-finder
source: Reveal in Finder
es_419: Mostrar en el Finder

# checkpoints.actions.delete
source: Delete
es_419: Eliminar

# checkpoints.quantize.saved-size-summary
source: Saved %@ — %.1f MB → %.1f MB
es_419: Guardado %@ — %.1f MB → %.1f MB

# checkpoints.quantize.failed
source: Quantization failed: %@
es_419: La cuantización falló: %@

# checkpoints.rename.success
source: Renamed checkpoint to %@
es_419: Checkpoint renombrado a %@

# checkpoints.rename.failed
source: Couldn't rename checkpoint: %@
es_419: No se pudo renombrar el checkpoint: %@

# checkpoints.duplicate.success
source: Duplicated %@
es_419: %@ duplicado

# checkpoints.duplicate.failed
source: Couldn't duplicate checkpoint: %@
es_419: No se pudo duplicar el checkpoint: %@

# model-card.header.title
source: # Model Card
es_419: # Tarjeta del Modelo

# model-card.header.generated-date
source: Generated by LabLLM on %@.
es_419: Generado por LabLLM el %@.

# model-card.section.architecture
source: ## Architecture
es_419: ## Arquitectura

# model-card.architecture.type
source: - Type: GPT-style decoder-only transformer
es_419: - Tipo: transformer solo decodificador estilo GPT

# model-card.architecture.layers
source: - Layers: %d
es_419: - Capas: %d

# model-card.architecture.hidden-dimension
source: - Hidden dimension: %d
es_419: - Dimensión oculta: %d

# model-card.architecture.context-length
source: - Context length: %d
es_419: - Longitud de contexto: %d

# model-card.architecture.mlp-ratio
source: - MLP ratio: %@
es_419: - Proporción MLP: %@

# model-card.architecture.weight-tying
source: - Weight tying: %@
es_419: - Compartición de pesos: %@

# model-card.boolean.yes
source: yes
es_419: sí

# model-card.architecture.parameters-approx
source: - Parameters (approx.): %@
es_419: - Parámetros (aprox.): %@

# model-card.section.tokenizer
source: ## Tokenizer
es_419: ## Tokenizador

# model-card.tokenizer.kind
source: - Kind: %@
es_419: - Tipo: %@

# model-card.tokenizer.vocabulary-size
source: - Vocabulary size: %d
es_419: - Tamaño de vocabulario: %d

# model-card.section.training
source: ## Training
es_419: ## Entrenamiento

# model-card.training.method
source: - Method: %@
es_419: - Método: %@

# model-card.training.steps-completed
source: - Steps completed: %d
es_419: - Pasos completados: %d

# model-card.training.final-train-loss
source: - Final train loss: %.4f
es_419: - Pérdida de entrenamiento final: %.4f

# model-card.training.final-val-loss
source: - Final val loss: %.4f
es_419: - Pérdida de validación final: %.4f

# model-card.hardware.trained-on
source: - Trained on: %@
es_419: - Entrenado en: %@

# model-card.hardware.unified-memory-gb
source: - Unified memory: %.0f GB
es_419: - Memoria unificada: %.0f GB

# model-card.section.limitations
source: ## Limitations
es_419: ## Limitaciones

# model-card.limitations.local-demo-not-production
source: - Small local model trained for demonstration/learning purposes, not production use.
es_419: - Modelo local pequeño entrenado para fines de demostración y aprendizaje, no para uso en producción.

# model-card.limitations.output-quality
source: - May produce inaccurate, repetitive, or nonsensical output, especially outside its training distribution.
es_419: - Puede producir salida inexacta, repetitiva o incoherente, especialmente fuera de su distribución de entrenamiento.

# model-card.limitations.not-evaluated-safety-bias-factual
source: - Not evaluated for safety, bias, or factual reliability.
es_419: - No evaluado en seguridad, sesgo ni confiabilidad factual.

# model-card.section.intended-use
source: ## Intended use
es_419: ## Uso previsto

# model-card.intended-use.local-experimentation-only
source: Local experimentation and learning about how small language models are trained. Not intended for deployment.
es_419: Experimentación y aprendizaje local sobre cómo se entrenan modelos de lenguaje pequeños. No está diseñado para despliegue en producción.

# content.sidebar.group.home
source: HOME
es_419: INICIO

# content.sidebar.group.build
source: BUILD
es_419: CONSTRUIR

# content.sidebar.group.run
source: RUN
es_419: EJECUTAR

# content.sidebar.group.analyze
source: ANALYZE
es_419: ANALIZAR

# content.sidebar.group.system
source: SYSTEM
es_419: SISTEMA

# content.sidebar.group.home-filter
source: HOME
es_419: INICIO

# content.sidebar.group.build-filter
source: BUILD
es_419: CONSTRUIR

# content.sidebar.group.run-filter
source: RUN
es_419: EJECUTAR

# content.sidebar.group.analyze-filter
source: ANALYZE
es_419: ANALIZAR

# content.sidebar.group.system-filter
source: SYSTEM
es_419: SISTEMA

# content.actions.replay-tutorial
source: Replay tutorial
es_419: Repetir tutorial

# content.status.mode-suffix
source: mode
es_419: modo

# content.training.status.progress-step
source: %d%% · Step %d/%d
es_419: %d%% · Paso %d/%d

# content.training.status.loss-format
source: loss %.3f
es_419: pérdida %.3f

# fine-tune-data.header.dataset-studio
source: Dataset Studio
es_419: Estudio de datasets

# fine-tune-data.header.title
source: Fine-tuning Data
es_419: Datos de ajuste fino

# fine-tune-data.header.subtitle
source: Find compatible instruction datasets and install them to disk. The SFT mix itself is composed in Training.
es_419: Encuentra datasets de instruction compatibles e instálalos en el disco. La mezcla SFT en sí se compone en Entrenamiento.

# fine-tune-data.alert.dataset-problem.title
source: Dataset problem
es_419: Problema con el dataset

# fine-tune-data.alert.ok
source: OK
es_419: Aceptar

# fine-tune-data.actions.browse
source: Browse fine-tuning data
es_419: Explorar datos de ajuste fino

# fine-tune-data.actions.import-imessage-chatdb
source: Import iMessage chat.db
es_419: Importar chat.db de iMessage

# fine-tune-data.actions.import-local-jsonl
source: Import local JSONL
es_419: Importar JSONL local

# fine-tune-data.actions.search-hugging-face
source: Search Hugging Face
es_419: Buscar en Hugging Face

# fine-tune-data.help.search-priority
source: Starred sources are pinned first in every mode. Results prioritize importable instruction and conversation data, including Parquet-backed datasets.
es_419: Las fuentes destacadas se fijan primero en todos los modos. Los resultados priorizan datos importables de instruction y conversación, incluyendo datasets respaldados por Parquet.

# fine-tune-data.search.loading
source: Searching datasets…
es_419: Buscando conjuntos de datos…

# fine-tune-data.empty.select-dataset.title
source: Select a dataset
es_419: Selecciona un conjunto de datos

# fine-tune-data.empty.select-dataset.subtitle
source: Inspect a compatible JSONL dataset before installing it.
es_419: Inspecciona un conjunto de datos JSONL compatible antes de instalarlo.

# fine-tune-data.dataset.download-and-install
source: Download and install
es_419: Descargar e instalar

# fine-tune-data.dataset.install
source: Install dataset
es_419: Instalar dataset

# fine-tune-data.dataset.stats.downloads
source: Downloads
es_419: Descargas

# fine-tune-data.dataset.stats.likes
source: Likes
es_419: Me gusta

# fine-tune-data.dataset.stats.rows
source: Rows
es_419: Filas

# fine-tune-data.dataset.compatible-file
source: Compatible file
es_419: Archivo compatible

# fine-tune-data.dataset.reading-repository-files
source: Reading repository files…
es_419: Leyendo archivos del repositorio…

# fine-tune-data.repository.no-compatible-jsonl
source: No compatible JSON or JSONL file was found in this repository. Choose a different dataset or import a local JSONL file.
es_419: No se encontró ningún archivo JSON o JSONL compatible en este repositorio. Elige un dataset diferente o importa un archivo JSONL local.

# fine-tune-data.repository.data-file.label
source: Data file
es_419: Archivo de datos

# fine-tune-data.dataset-card.section-title
source: Dataset card
es_419: Tarjeta del dataset

# fine-tune-data.dataset-card.loading-readme
source: Loading README…
es_419: Cargando README…

# fine-tune-data.viewer-import.section-title
source: Dataset Viewer import
es_419: Importar dataset del visor

# fine-tune-data.viewer-import.conversion-summary
source: Hugging Face will convert %@ / %@ into recognized chat or instruction rows.
es_419: Hugging Face convertirá %@ / %@ en filas reconocidas de chat o instruction.

# fine-tune-data.viewer-import.row-limit-summary
source: Import %@ of %@ rows
es_419: Importando %@ de %@ filas

# fine-tune-data.search-result.rows
source: %@ rows
es_419: %@ filas

# dataset.header.studio
source: Dataset Studio
es_419: Estudio de datasets

# dataset.header.title
source: Pre-Training Data
es_419: Datos de Pre-entrenamiento

# dataset.header.subtitle
source: Browse public Hugging Face corpora and install them to disk. How much of each one a run uses is set in Training.
es_419: Explora corpora públicos de Hugging Face e instálalos en el disco. La cantidad que se usa de cada uno en una ejecución se configura en Entrenamiento.

# dataset.alert.problem.title
source: Dataset problem
es_419: Problema con el dataset

# dataset.actions.browse
source: Browse pre-training data
es_419: Explorar datos de pre-entrenamiento

# dataset.actions.import-local-text
source: Import local text
es_419: Importar texto local

# dataset.actions.search-hugging-face
source: Search Hugging Face
es_419: Buscar en Hugging Face

# dataset.search.help.pinned-and-persisted
source: Starred sources are pinned first in every mode. Installed data is written to disk and stays available after a relaunch.
es_419: Las fuentes destacadas se fijan primero en todos los modos. Los datos instalados se guardan en el disco y permanecen disponibles después de reiniciar.

# dataset.search.loading
source: Searching datasets…
es_419: Buscando conjuntos de datos…

# dataset.empty.select.title
source: Select a dataset
es_419: Selecciona un conjunto de datos

# dataset.empty.select.subtitle
source: Search or browse the list to inspect a public dataset before installing it.
es_419: Busca o navega la lista para inspeccionar un conjunto de datos público antes de instalarlo.

# dataset.actions.download-and-install
source: Download and install
es_419: Descargar e instalar

# dataset.actions.install-corpus
source: Install corpus
es_419: Instalar corpus

# dataset.metadata.downloads
source: Downloads
es_419: Descargas

# dataset.metadata.likes
source: Likes
es_419: Me gusta

# dataset.file-selection.download.label
source: Download
es_419: Descarga

# dataset.file-selection.choose-file
source: Choose a file
es_419: Elige un archivo

# dataset.file-selection.import-file
source: Import file
es_419: Importar archivo

# dataset.file-selection.loading-repository-files
source: Reading repository files…
es_419: Leyendo archivos del repositorio…

# dataset.repository.no-importable-file
source: This repository has no directly importable text, JSON, JSONL, or CSV file.
es_419: Este repositorio no tiene ningún archivo de texto, JSON, JSONL o CSV directamente importable.

# dataset.repository.file.label
source: File
es_419: Archivo

# dataset.details.card.title
source: Dataset card
es_419: Tarjeta del dataset

# dataset.details.card.loading-readme
source: Loading README…
es_419: Cargando README…

# dataset.viewer-import.title
source: Dataset Viewer import
es_419: Importar dataset del visor

# dataset.viewer-import.conversion-summary
source: Hugging Face will convert this dataset's %@ / %@ split into training text.
es_419: Hugging Face convertirá el split %@ / %@ de este dataset en texto de entrenamiento.

# dataset.viewer-import.row-limit-summary
source: Import %@ of %@ rows
es_419: Importar %@ de %@ filas

# recipes.header.section
source: Build
es_419: Construir

# recipes.header.title
source: Recipes
es_419: Recetas

# recipes.header.subtitle
source: Complete runs you can start in one click: model, hyperparameters, tokenizer and the data they need.
es_419: Ejecuciones completas que puedes iniciar en un clic: modelo, hiperparámetros, tokenizador y los datos que necesitan.

# recipes.actions.setup-in-active-model
source: Set up in %@
es_419: Configura en %@

# recipes.actions.setup-in-new-model
source: Set up in a new model
es_419: Configurar en un modelo nuevo

# recipes.help.apply-replaces-and-opens-training
source: Applying a recipe replaces this model's hyperparameters and its %@ mix, then opens Training.
es_419: Aplicar una receta reemplaza los hiperparámetros de este modelo y su mezcla de %@, y luego abre Entrenamiento.

# recipes.data-kind.pre-training
source: pre-training
es_419: pre-entrenamiento

# recipes.data-kind.fine-tuning
source: fine-tuning
es_419: ajuste fino

# recipes.section.what-to-watch
source: What to watch
es_419: Qué observar

# recipes.section.required-data
source: Data this recipe needs
es_419: Datos que necesita esta receta

# recipes.required-data.status.installed
source: Installed
es_419: Instalado

# recipes.required-data.status.downloads-on-start
source: Downloads on start
es_419: Descargas al iniciar

# recipes.section.exact-configuration
source: Exact configuration it applies
es_419: Configuración exacta aplicada
